In [1]:
import pandas as pd
df = pd.read_csv('data/arquivo.csv',index_col=0)
df.head()

       Nome   idade
cpf
123   Thiago     10
456  Jéssica     27

In [30]:
df.columns

Index(['Nome ', 'idade'], dtype='object')

In [31]:
df.rename(mapper=str.strip, axis="columns").columns

Index(['Nome', 'idade'], dtype='object')

In [10]:
df = df.rename(columns = {'idade': 'age'})
df.columns

Index(['"Nome  "', 'age'], dtype='object')

In [23]:
cols = list(df.columns)
cols

['Nome ', 'idade']

In [24]:
cols = [x.lower().strip() for x in cols]
cols

['nome', 'idade']

In [25]:
df.columns = cols
df.columns

Index(['nome', 'idade'], dtype='object')

In [19]:
# JOINS

staff = pd.DataFrame([
    {'name': 'Thiago', 'role': 'dba'},
    {'name': 'Thais',  'role': 'developer'},
    {'name': 'Arthur', 'role': 'infra'}
])

students = pd.DataFrame([
    {'name': 'Thiago', 'school': 'USP'},
    {'name': 'Bruno',  'school': 'Unicamp'},
    {'name': 'Pedro',  'school': 'Unesp'}
])

In [20]:
# full join
pd.merge(staff,students,how='outer',on='name')

     name       role   school
0  Thiago        dba      USP
1   Thais  developer      NaN
2  Arthur      infra      NaN
3   Bruno        NaN  Unicamp
4   Pedro        NaN    Unesp

In [21]:
# inner join
pd.merge(staff,students,how='inner',on='name')

     name role school
0  Thiago  dba    USP

In [22]:
# left join
pd.merge(staff,students,how='left',on='name')

     name       role school
0  Thiago        dba    USP
1   Thais  developer    NaN
2  Arthur      infra    NaN

In [23]:
# right join
pd.merge(staff,students,how='right',on='name')

     name role   school
0  Thiago  dba      USP
1   Bruno  NaN  Unicamp
2   Pedro  NaN    Unesp

In [27]:
# conflicts
staff = pd.DataFrame([
    {'name': 'Thiago', 'role': 'dba', 'location': 'SP'},
    {'name': 'Thais',  'role': 'developer', 'location': 'BH'},
    {'name': 'Arthur', 'role': 'infra', 'location': 'RA'}
])

students = pd.DataFrame([
    {'name': 'Thiago', 'school': 'USP', 'location': 'MG'},
    {'name': 'Bruno',  'school': 'Unicamp', 'location': 'SP'},
    {'name': 'Pedro',  'school': 'Unesp', 'location': 'SP'}
])
pd.merge(staff,students,how='outer',on='name')

     name       role location_x   school location_y
0  Thiago        dba         SP      USP         MG
1   Thais  developer         BH      NaN        NaN
2  Arthur      infra         RA      NaN        NaN
3   Bruno        NaN        NaN  Unicamp         SP
4   Pedro        NaN        NaN    Unesp         SP

In [28]:
# JOINS twe columns

staff = pd.DataFrame([
    {'name': 'Thiago', 'last': 'silva' , 'role': 'dba'},
    {'name': 'Thais', 'last': 'silva' , 'role': 'developer'},
    {'name': 'Arthur', 'last': 'silva' ,'role': 'infra'}
])

students = pd.DataFrame([
    {'name': 'Thiago','last': 'silva' , 'school': 'USP'},
    {'name': 'Bruno', 'last': 'silva' , 'school': 'Unicamp'},
    {'name': 'Pedro', 'last': 'silva' , 'school': 'Unesp'}
])
pd.merge(staff,students,how='outer',on=['name','last'])

     name   last       role   school
0  Thiago  silva        dba      USP
1   Thais  silva  developer      NaN
2  Arthur  silva      infra      NaN
3   Bruno  silva        NaN  Unicamp
4   Pedro  silva        NaN    Unesp

In [36]:
data1 = pd.DataFrame([
    {'Z': 'Fe', 'value': 100},
    {'Z': 'Ca', 'value': 120}
])

data2 = pd.DataFrame([
    {'Z': 'Fe', 'value': 150},
    {'Z': 'Ca', 'value': 110}
])
pd.concat([data1,data2],keys=[2010,2011])

         Z  value
2010 0  Fe    100
     1  Ca    120
2011 0  Fe    150
     1  Ca    110